# Pacman packages (official repositories)
# Install with: sudo pacman -S --needed - < packages/pacman.txt

# Base System
base
base-devel
linux
linux-headers
linux-firmware

# Bootloader
grub
efibootmgr
os-prober

# Drivers
nvidia-open-dkms
nvidia-hook
libva-nvidia-driver
lib32-nvidia-utils
intel-ucode
intel-media-driver

# Audio
alsa-firmware
alsa-plugins
alsa-utils
pipewire-alsa
pipewire-jack
pipewire-pulse
sof-firmware

# Bluetooth
bluez
bluez-utils

# Network
networkmanager-openconnect
networkmanager-openvpn
iwd
firewalld
tailscale
cloudflared
nfs-utils
openssh

# Hyprland & Desktop
hyprland
waybar
xdg-utils
gvfs-smb

# Display
nwg-displays
nwg-look
gdm
sddm

# Terminal & Shell
kitty
zsh
zsh-autosuggestions

# File Manager
nautilus

# Text Editor
neovim
nano
nano-syntax-highlighting

# Development
git
git-filter-repo
nodejs
npm
yarn
python
python-pip
docker
docker-compose
jdk17-openjdk
jre21-openjdk
terraform
postgresql
valkey

# Fonts
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ttf-dejavu
ttf-liberation
ttf-opensans
ttf-bitstream-vera
cantarell-fonts

# Cursor Themes
capitaine-cursors
vimix-cursors

# Icon Theme
papirus-icon-theme

# Qt Theming
qt5ct
qt6ct
kvantum

# Input Method (Vietnamese)
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-lua
fcitx5-qt
fcitx5-unikey

# Multimedia
mpv
obs-studio
ffmpegthumbnailer
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
libdvdcss

# Office
libreoffice-fresh

# Browsers
firefox

# System Tools
btop
htop
nvtop
glances
fastfetch
inxi
plocate
reflector
snapper
btrfs-progs
btrfs-assistant
duf
tldr
meld
scrcpy

# Archive
unrar
unzip

# Virtualization
virtualbox
virtualbox-host-modules-arch

# Misc
rofi
telegram-desktop
wev
