accountsservice
alsa-firmware
alsa-plugins
alsa-utils
archlinux-xdg-menu
aspell
b43-fwcutter
base
base-devel
bash-completion
bind
bluez
bluez-utils
btop
btrfs-assistant
btrfs-progs
cantarell-fonts
capitaine-cursors
cloudflared
cryptsetup
device-mapper
diffutils
dmidecode
dmraid
dnsmasq
docker
docker-compose
dosfstools
downgrade
dracut
duf
e2fsprogs
easy-rsa
efibootmgr
efitools
endeavouros-keyring
endeavouros-mirrorlist
eos-dracut
eos-hooks
eos-packagelist
eos-rankmirrors
ethtool
exfatprogs
f2fs-tools
fastfetch
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-lua
fcitx5-qt
fcitx5-unikey
ffmpegthumbnailer
firefox
firewalld
gdm
git
git-filter-repo
glances
gnome-control-center
grub
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
gvfs-smb
haveged
hdparm
htop
hwdetect
hwinfo
hyprland
inetutils
intel-media-driver
intel-ucode
inxi
iptables-nft
iwd
jdk17-openjdk
jfsutils
jre21-openjdk
kate
kdoctools
konsole
kvantum
less
lib32-nvidia-utils
libappindicator
libayatana-appindicator
libdvdcss
libgsf
libopenraw
libreoffice-fresh
libva-nvidia-driver
libwnck3
linux
linux-firmware
linux-headers
logrotate
lsb-release
lsscsi
lvm2
man-db
man-pages
mdadm
meld
mesa-utils
modemmanager
mpv
mtools
nano
nano-syntax-highlighting
nautilus
neovim
netctl
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
nmap
nodejs
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npm
nss-mdns
ntfs-3g
ntp
nvidia-hook
nvidia-inst
nvidia-open-dkms
nvtop
nwg-displays
nwg-look
obs-studio
openbox
openssh
os-prober
pacman-contrib
papirus-icon-theme
perl
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
plasma-browser-integration
plocate
poppler-glib
postgresql
power-profiles-daemon
pv
python
python-defusedxml
python-packaging
python-pip
python-pyqt6
qt5ct
qt6ct
rebuild-detector
reflector
reflector-simple
rofi
rtkit
s-nail
scrcpy
sddm
sg3_utils
smartmontools
snapper
socat
sof-firmware
speedtest-cli
stalonetray
sudo
sysfsutils
systemd-sysvcompat
tailscale
telegram-desktop
terraform
texinfo
tldr
ttf-bitstream-vera
ttf-dejavu
ttf-liberation
ttf-opensans
unrar
unzip
usb_modeswitch
usbutils
valkey
vi
vimix-cursors
virtualbox
virtualbox-host-modules-arch
waybar
wev
which
wpa_supplicant
xdg-utils
xf86-input-libinput
xf86-video-fbdev
xf86-video-vesa
xfsprogs
xl2tpd
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-smproxy
xorg-x11perf
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xpr
xorg-xrandr
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xterm
yarn
yay
zsh
zsh-autosuggestions
